In [1]:
import pandas as pd

In [2]:
df_movies = pd.read_csv('IMDb movies.csv', low_memory=False)
df_ratings = pd.read_csv('IMDb ratings.csv')

In [3]:
df_ratings

,imdb_title_id,weighted_average_vote,total_votes,mean_vote,median_vote,votes_10,votes_9,votes_8,votes_7,votes_6,...,females_30age_avg_vote,females_30age_votes,females_45age_avg_vote,females_45age_votes,top1000_voters_rating,top1000_voters_votes,us_voters_rating,us_voters_votes,non_us_voters_rating,non_us_voters_votes
0,tt0000009,5.9,154,5.9,6.0,12,4,10,43,28,...,5.7,13.0,4.5,4.0,5.7,34.0,6.4,51.0,6.0,70.0
1,tt0000574,6.1,589,6.3,6.0,57,18,58,137,139,...,6.2,23.0,6.6,14.0,6.4,66.0,6.0,96.0,6.2,331.0
2,tt0001892,5.8,188,6.0,6.0,6,6,17,44,52,...,5.8,4.0,6.8,7.0,5.4,32.0,6.2,31.0,5.9,123.0
3,tt0002101,5.2,446,5.3,5.0,15,8,16,62,98,...,5.5,14.0,6.1,21.0,4.9,57.0,5.5,207.0,4.7,105.0
4,tt0002130,7.0,2237,6.9,7.0,210,225,436,641,344,...,7.3,82.0,7.4,77.0,6.9,139.0,7.0,488.0,7.0,1166.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
85850,tt9908390,5.3,398,5.5,6.0,13,9,26,65,104,...,5.7,11.0,5.0,2.0,5.5,12.0,6.3,22.0,5.3,214.0
85851,tt9911196,7.7,724,7.9,8.0,65,139,288,170,42,...,8.0,47.0,7.3,30.0,7.0,6.0,6.8,13.0,7.7,388.0
85852,tt9911774,7.9,265,7.8,8.0,63,29,61,61,31,...,NaN,NaN,NaN,NaN,1.0,1.0,NaN,NaN,2.0,2.0
85853,tt9914286,6.4,194,9.4,10.0,176,0,2,2,1,...,NaN,NaN,7.0,1.0,4.0,3.0,1.7,5.0,5.8,5.0
85854,tt9914942,6.7,102,6.8,7.0,4,4,21,35,27,...,6.8,4.0,7.5,4.0,7.0,4.0,6.7,13.0,6.7,60.0

In [4]:
#select columns
df_movies = df_movies[['imdb_title_id', 'title', 'year', 'genre', 'country']]
df_ratings = df_ratings[['imdb_title_id', 'total_votes', 'mean_vote']]

# 1 merge()

In [5]:
df1 = pd.DataFrame({'id': ['A', 'B', 'C', 'D'],
                    'age': [30, 23, 25, 22]})
df2 = pd.DataFrame({'id': ['C', 'D', 'E', 'F'],
                    'job': ['Doctor', 'Engineer', 'Accountant', 'Developer']})

In [6]:
df1

  id  age
0  A   30
1  B   23
2  C   25
3  D   22

In [7]:
df2

  id         job
0  C      Doctor
1  D    Engineer
2  E  Accountant
3  F   Developer

## 1.1 Inner join

In [8]:
df_inner_join = df1.merge(df2, on='id', how='inner')
df_inner_join

  id  age       job
0  C   25    Doctor
1  D   22  Engineer

In [9]:
#shape
print(df1.shape)
print(df2.shape)
print(df_inner_join.shape)

(4, 2)
(4, 2)
(2, 3)

## 1.1.1 Exercise

In [10]:
#merge df_movies and df_ratings(inner join)

In [11]:
df_inner_join = df_movies.merge(df_ratings, on='imdb_title_id', how='inner')

In [12]:
df_inner_join

,imdb_title_id,title,year,genre,country,total_votes,mean_vote
0,tt0000009,Miss Jerry,1894,Romance,USA,154,5.9
1,tt0000574,The Story of the Kelly Gang,1906,"Biography, Crime, Drama",Australia,589,6.3
2,tt0001892,Den sorte drøm,1911,Drama,"Germany, Denmark",188,6.0
3,tt0002101,Cleopatra,1912,"Drama, History",USA,446,5.3
4,tt0002130,L'Inferno,1911,"Adventure, Drama, Fantasy",Italy,2237,6.9
...,...,...,...,...,...,...,...
85850,tt9908390,Le lion,2020,Comedy,"France, Belgium",398,5.5
85851,tt9911196,De Beentjes van Sint-Hildegard,2020,"Comedy, Drama",Netherlands,724,7.9
85852,tt9911774,Padmavyuhathile Abhimanyu,2019,Drama,India,265,7.8
85853,tt9914286,Sokagin Çocuklari,2019,"Drama, Family",Turkey,194,9.4
85854,tt9914942,La vida sense la Sara Amat,2019,Drama,Spain,102,6.8

# 1.2 Outer join(Full join)

In [13]:
df_outer_join = df1.merge(df2, on='id', how='outer')
df_outer_join

  id   age         job
0  A  30.0         NaN
1  B  23.0         NaN
2  C  25.0      Doctor
3  D  22.0    Engineer
4  E   NaN  Accountant
5  F   NaN   Developer

## 1.2.1 Exercise

In [14]:
#merge df_movies and df_ratings(outer join)
df_outer_join = df_movies.merge(df_ratings, on='imdb_title_id', how='outer')

In [15]:
df_outer_join

,imdb_title_id,title,year,genre,country,total_votes,mean_vote
0,tt0000009,Miss Jerry,1894,Romance,USA,154,5.9
1,tt0000574,The Story of the Kelly Gang,1906,"Biography, Crime, Drama",Australia,589,6.3
2,tt0001892,Den sorte drøm,1911,Drama,"Germany, Denmark",188,6.0
3,tt0002101,Cleopatra,1912,"Drama, History",USA,446,5.3
4,tt0002130,L'Inferno,1911,"Adventure, Drama, Fantasy",Italy,2237,6.9
...,...,...,...,...,...,...,...
85850,tt9908390,Le lion,2020,Comedy,"France, Belgium",398,5.5
85851,tt9911196,De Beentjes van Sint-Hildegard,2020,"Comedy, Drama",Netherlands,724,7.9
85852,tt9911774,Padmavyuhathile Abhimanyu,2019,Drama,India,265,7.8
85853,tt9914286,Sokagin Çocuklari,2019,"Drama, Family",Turkey,194,9.4
85854,tt9914942,La vida sense la Sara Amat,2019,Drama,Spain,102,6.8

# 1.3 Exclusive outer join(Exclusive full join)

In [16]:
df_outer_join = df1.merge(df2, on='id', how='outer')
df_outer_join

  id   age         job
0  A  30.0         NaN
1  B  23.0         NaN
2  C  25.0      Doctor
3  D  22.0    Engineer
4  E   NaN  Accountant
5  F   NaN   Developer

In [17]:
#indicator=True
df_outer_join = df1.merge(df2, on='id', how='outer', indicator=True)
df_outer_join

  id   age         job      _merge
0  A  30.0         NaN   left_only
1  B  23.0         NaN   left_only
2  C  25.0      Doctor        both
3  D  22.0    Engineer        both
4  E   NaN  Accountant  right_only
5  F   NaN   Developer  right_only

In [18]:
#query
df_outer_join = df1.merge(df2, on='id', how='outer', indicator=True).query("_merge=='left_only' or _merge=='right_only'")
df_outer_join

  id   age         job      _merge
0  A  30.0         NaN   left_only
1  B  23.0         NaN   left_only
4  E   NaN  Accountant  right_only
5  F   NaN   Developer  right_only

In [19]:
#shape
df_outer_join.shape

(4, 4)

## 1.3.1 Exercise

In [20]:
#merge df_movies and df_ratings
df_outer_join = df_movies.merge(df_ratings, on='imdb_title_id', how='outer', indicator=True).query("_merge=='left_only' or _merge=='right_only'")
df_outer_join

Empty DataFrame
Columns: [imdb_title_id, title, year, genre, country, total_votes, mean_vote, _merge]
Index: []

# 1.4 Left join

In [21]:
df_left_join = df1.merge(df2, on='id', how='left')
df_left_join

  id  age       job
0  A   30       NaN
1  B   23       NaN
2  C   25    Doctor
3  D   22  Engineer

## 1.4.1 Exercise

In [22]:
#extract a 50% sample of the df_movies dataframe
df_sample = df_movies.sample(frac=0.5)
df_sample

,imdb_title_id,title,year,genre,country
41631,tt0312941,Mak Dau goo si,2001,"Animation, Comedy, Drama",Hong Kong
24457,tt0096966,Boj na Kosovu,1989,"Drama, History, War",Yugoslavia
53008,tt10452480,Kettiyollaanu Ente Maalakha,2019,"Comedy, Drama",India
46679,tt0436158,Carpool Guy,2005,Comedy,USA
16783,tt0072208,Sto dney posle detstva,1975,"Drama, Romance",Soviet Union
...,...,...,...,...,...
29674,tt0116153,Dushman Duniya Ka,1996,Drama,India
42215,tt0327520,Brak,2002,"Comedy, Drama",Czech Republic
485,tt0016847,Faust,1926,"Drama, Fantasy, Horror",Germany
56466,tt1286129,Ask Tutulmasi,2008,"Comedy, Romance",Turkey
4616,tt0036428,Incontro nel buio,1943,"Mystery, Romance, Thriller",UK

In [23]:
#merge df_movies_sample and df_ratings(left join)
df_left_join = df_sample.merge(df_ratings, on='imdb_title_id', how='outer')
df_left_join

,imdb_title_id,title,year,genre,country,total_votes,mean_vote
0,tt0000009,Miss Jerry,1894,Romance,USA,154,5.9
1,tt0000574,NaN,NaN,NaN,NaN,589,6.3
2,tt0001892,Den sorte drøm,1911,Drama,"Germany, Denmark",188,6.0
3,tt0002101,Cleopatra,1912,"Drama, History",USA,446,5.3
4,tt0002130,L'Inferno,1911,"Adventure, Drama, Fantasy",Italy,2237,6.9
...,...,...,...,...,...,...,...
85850,tt9908390,NaN,NaN,NaN,NaN,398,5.5
85851,tt9911196,De Beentjes van Sint-Hildegard,2020,"Comedy, Drama",Netherlands,724,7.9
85852,tt9911774,NaN,NaN,NaN,NaN,265,7.8
85853,tt9914286,Sokagin Çocuklari,2019,"Drama, Family",Turkey,194,9.4
85854,tt9914942,NaN,NaN,NaN,NaN,102,6.8

In [24]:
#shape
df_left_join.shape

(85855, 7)

# 1.5 Exclusive left join

In [33]:
df1.merge(df2, on='id', how='outer')

  id   age         job
0  A  30.0         NaN
1  B  23.0         NaN
2  C  25.0      Doctor
3  D  22.0    Engineer
4  E   NaN  Accountant
5  F   NaN   Developer

In [34]:
#indicator=True
df1.merge(df2, on='id', how='outer', indicator=True)

  id   age         job      _merge
0  A  30.0         NaN   left_only
1  B  23.0         NaN   left_only
2  C  25.0      Doctor        both
3  D  22.0    Engineer        both
4  E   NaN  Accountant  right_only
5  F   NaN   Developer  right_only

In [35]:
#query
df1.merge(df2, on='id', how='outer', indicator=True).query("_merge=='left_only'")

  id   age  job     _merge
0  A  30.0  NaN  left_only
1  B  23.0  NaN  left_only

In [28]:
#left join

## 1.5.1 Exercise

In [38]:
#make a copy of the df_movies dataframe
df_movies_2 = df_movies.copy()
df_movies_2

,imdb_title_id,title,year,genre,country
0,tt0000009,Miss Jerry,1894,Romance,USA
1,tt0000574,The Story of the Kelly Gang,1906,"Biography, Crime, Drama",Australia
2,tt0001892,Den sorte drøm,1911,Drama,"Germany, Denmark"
3,tt0002101,Cleopatra,1912,"Drama, History",USA
4,tt0002130,L'Inferno,1911,"Adventure, Drama, Fantasy",Italy
...,...,...,...,...,...
85850,tt9908390,Le lion,2020,Comedy,"France, Belgium"
85851,tt9911196,De Beentjes van Sint-Hildegard,2020,"Comedy, Drama",Netherlands
85852,tt9911774,Padmavyuhathile Abhimanyu,2019,Drama,India
85853,tt9914286,Sokagin Çocuklari,2019,"Drama, Family",Turkey
85854,tt9914942,La vida sense la Sara Amat,2019,Drama,Spain

In [40]:
#set the first 1000 values of 'imdb_title_id' column as 'tt1234567890'
for index in df_movies_2.index:
    if index<1000:
        df_movies_2.loc[index, 'imdb_title_id'] =   'tt1234567890'

In [41]:
df_movies_2

,imdb_title_id,title,year,genre,country
0,tt1234567890,Miss Jerry,1894,Romance,USA
1,tt1234567890,The Story of the Kelly Gang,1906,"Biography, Crime, Drama",Australia
2,tt1234567890,Den sorte drøm,1911,Drama,"Germany, Denmark"
3,tt1234567890,Cleopatra,1912,"Drama, History",USA
4,tt1234567890,L'Inferno,1911,"Adventure, Drama, Fantasy",Italy
...,...,...,...,...,...
85850,tt9908390,Le lion,2020,Comedy,"France, Belgium"
85851,tt9911196,De Beentjes van Sint-Hildegard,2020,"Comedy, Drama",Netherlands
85852,tt9911774,Padmavyuhathile Abhimanyu,2019,Drama,India
85853,tt9914286,Sokagin Çocuklari,2019,"Drama, Family",Turkey
85854,tt9914942,La vida sense la Sara Amat,2019,Drama,Spain

In [47]:
#merge df_movies_2 and df_ratings(exclusive left join)
df_exclusive_left = df_movies_2.merge(df_ratings, on='imdb_title_id', how='outer', indicator=True).query("_merge=='left_only'")
df_exclusive_left

,imdb_title_id,title,year,genre,country,total_votes,mean_vote,_merge
55817,tt1234567890,Miss Jerry,1894,Romance,USA,NaN,NaN,left_only
55818,tt1234567890,The Story of the Kelly Gang,1906,"Biography, Crime, Drama",Australia,NaN,NaN,left_only
55819,tt1234567890,Den sorte drøm,1911,Drama,"Germany, Denmark",NaN,NaN,left_only
55820,tt1234567890,Cleopatra,1912,"Drama, History",USA,NaN,NaN,left_only
55821,tt1234567890,L'Inferno,1911,"Adventure, Drama, Fantasy",Italy,NaN,NaN,left_only
...,...,...,...,...,...,...,...,...
56812,tt1234567890,Agente segreto Z1,1930,Drama,USA,NaN,NaN,left_only
56813,tt1234567890,Tom Sawyer,1930,"Adventure, Comedy, Drama",USA,NaN,NaN,left_only
56814,tt1234567890,Tonka Sibenice,1930,Drama,"Czechoslovakia, Germany",NaN,NaN,left_only
56815,tt1234567890,Top Speed,1930,"Comedy, Musical, Romance",USA,NaN,NaN,left_only
56816,tt1234567890,True to the Navy,1930,"Action, Comedy, Romance",USA,NaN,NaN,left_only

In [48]:
#shape
df_exclusive_left.shape

(1000, 8)

# 1.6 Right join

In [49]:
df_right_join = df1.merge(df2, on='id', how='right')
df_right_join

  id   age         job
0  C  25.0      Doctor
1  D  22.0    Engineer
2  E   NaN  Accountant
3  F   NaN   Developer

## 1.6.1 Exercise

In [50]:
#extract a 50% sample of the df_movies dataframe
df_sample = df_movies.sample(frac=0.5)
df_sample

,imdb_title_id,title,year,genre,country
73442,tt4020156,National Theatre Live: A Streetcar Named Desire,2014,Drama,UK
40504,tt0289992,The Life of David Gale,2003,"Crime, Drama, Thriller","USA, Germany, UK, Spain"
60315,tt1641624,Ma part du gâteau,2011,"Comedy, Drama",France
51425,tt0910955,Tesko je biti fin,2007,"Comedy, Drama","UK, Slovenia, Serbia, Germany, Bosnia and Herz..."
72944,tt3862004,Fuddu,2016,"Comedy, Drama",India
...,...,...,...,...,...
7341,tt0045049,The Pride of St. Louis,1952,"Biography, Drama, Sport",USA
8997,tt0050143,"Lei, il mostro",1957,"Crime, Horror, Sci-Fi",USA
62373,tt1827429,Hangman's Game,2015,"Horror, Mystery, Thriller","Colombia, USA"
71594,tt3522806,Mechanic: Resurrection,2016,"Action, Adventure, Thriller","USA, France, Bulgaria, Germany"
39900,tt0280484,Bizim kiz,1977,"Comedy, Romance",Turkey

In [51]:
#merge df_movies_sample and df_ratings(right join)
df_right_join = df_sample.merge(df_ratings, on='imdb_title_id', how='outer')
df_right_join

,imdb_title_id,title,year,genre,country,total_votes,mean_vote
0,tt0000009,Miss Jerry,1894,Romance,USA,154,5.9
1,tt0000574,NaN,NaN,NaN,NaN,589,6.3
2,tt0001892,Den sorte drøm,1911,Drama,"Germany, Denmark",188,6.0
3,tt0002101,Cleopatra,1912,"Drama, History",USA,446,5.3
4,tt0002130,NaN,NaN,NaN,NaN,2237,6.9
...,...,...,...,...,...,...,...
85850,tt9908390,NaN,NaN,NaN,NaN,398,5.5
85851,tt9911196,NaN,NaN,NaN,NaN,724,7.9
85852,tt9911774,NaN,NaN,NaN,NaN,265,7.8
85853,tt9914286,NaN,NaN,NaN,NaN,194,9.4
85854,tt9914942,La vida sense la Sara Amat,2019,Drama,Spain,102,6.8

In [53]:
#shape
df_right_join.shape

(85855, 7)

# 1.5 Exclusive right join

In [54]:
df1.merge(df2, on='id', how='outer')

  id   age         job
0  A  30.0         NaN
1  B  23.0         NaN
2  C  25.0      Doctor
3  D  22.0    Engineer
4  E   NaN  Accountant
5  F   NaN   Developer

In [55]:
#indicator=True
df1.merge(df2, on='id', how='outer', indicator=True)

  id   age         job      _merge
0  A  30.0         NaN   left_only
1  B  23.0         NaN   left_only
2  C  25.0      Doctor        both
3  D  22.0    Engineer        both
4  E   NaN  Accountant  right_only
5  F   NaN   Developer  right_only

In [56]:
#query
df1.merge(df2, on='id', how='outer', indicator=True).query("_merge=='right_only'")

  id  age         job      _merge
4  E  NaN  Accountant  right_only
5  F  NaN   Developer  right_only

## 1.7.1 Exercise

In [58]:
#make a copy of the df_movies dataframe
df_movies_2 = df_movies.copy()
df_movies_2

,imdb_title_id,title,year,genre,country
0,tt0000009,Miss Jerry,1894,Romance,USA
1,tt0000574,The Story of the Kelly Gang,1906,"Biography, Crime, Drama",Australia
2,tt0001892,Den sorte drøm,1911,Drama,"Germany, Denmark"
3,tt0002101,Cleopatra,1912,"Drama, History",USA
4,tt0002130,L'Inferno,1911,"Adventure, Drama, Fantasy",Italy
...,...,...,...,...,...
85850,tt9908390,Le lion,2020,Comedy,"France, Belgium"
85851,tt9911196,De Beentjes van Sint-Hildegard,2020,"Comedy, Drama",Netherlands
85852,tt9911774,Padmavyuhathile Abhimanyu,2019,Drama,India
85853,tt9914286,Sokagin Çocuklari,2019,"Drama, Family",Turkey
85854,tt9914942,La vida sense la Sara Amat,2019,Drama,Spain

In [63]:
df_movies_2

,imdb_title_id,title,year,genre,country
0,tt1234567890,Miss Jerry,1894,Romance,USA
1,tt1234567890,The Story of the Kelly Gang,1906,"Biography, Crime, Drama",Australia
2,tt1234567890,Den sorte drøm,1911,Drama,"Germany, Denmark"
3,tt1234567890,Cleopatra,1912,"Drama, History",USA
4,tt1234567890,L'Inferno,1911,"Adventure, Drama, Fantasy",Italy
...,...,...,...,...,...
85850,tt9908390,Le lion,2020,Comedy,"France, Belgium"
85851,tt9911196,De Beentjes van Sint-Hildegard,2020,"Comedy, Drama",Netherlands
85852,tt9911774,Padmavyuhathile Abhimanyu,2019,Drama,India
85853,tt9914286,Sokagin Çocuklari,2019,"Drama, Family",Turkey
85854,tt9914942,La vida sense la Sara Amat,2019,Drama,Spain

In [64]:
#merge df_movies_2 and df_ratings(exclusive right join)
df_exclusive_right = df_movies_2.merge(df_ratings, on='imdb_title_id', how='outer', indicator=True).query("_merge=='right_only'")
df_exclusive_right

    imdb_title_id title year genre country  total_votes  mean_vote      _merge
0       tt0000009   NaN  NaN   NaN     NaN        154.0        5.9  right_only
1       tt0000574   NaN  NaN   NaN     NaN        589.0        6.3  right_only
2       tt0001892   NaN  NaN   NaN     NaN        188.0        6.0  right_only
3       tt0002101   NaN  NaN   NaN     NaN        446.0        5.3  right_only
4       tt0002130   NaN  NaN   NaN     NaN       2237.0        6.9  right_only
..            ...   ...  ...   ...     ...          ...        ...         ...
995     tt0021472   NaN  NaN   NaN     NaN        128.0        5.8  right_only
996     tt0021483   NaN  NaN   NaN     NaN        160.0        6.6  right_only
997     tt0021484   NaN  NaN   NaN     NaN        106.0        7.2  right_only
998     tt0021486   NaN  NaN   NaN     NaN        172.0        6.2  right_only
999     tt0021492   NaN  NaN   NaN     NaN        103.0        7.0  right_only

[1000 rows x 8 columns]

In [65]:
#shape
df_exclusive_right.shape

(1000, 8)